morpheby/arduino_core_ch32/cores/arduino/ch32/analog.cpp
#if defined(DAC_MODULE_ENABLED) && !defined(DAC_MODULE_ONLY)
/**
  * @brief  Return DAC HAL channel linked to a PinName
  * @param  pin: specific PinName's for ADC internal.
  * @retval Valid  channel
  */
uint32_t get_dac_channel(PinName pin)
{
  uint32_t function = pinmap_function(pin, PinMap_DAC);
  uint32_t channel = 0;
  switch (CH_PIN_CHANNEL(function)) 
  {
#ifdef DAC_Channel_1
    case 1:
      channel = DAC_Channel_1;
      break;
#endif
#ifdef DAC_Channel_2
    case 2:
      channel = DAC_Channel_2;
      break;
#endif
    default:
      _Error_Handler("DAC: Unknown dac channel", (int)(CH_PIN_CHANNEL(function)));
      break;
  }
  return channel;
}

////////////////////////// DAC INTERFACE FUNCTIONS /////////////////////////////
/**
  * @brief DAC  Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param hdac: DAC pointer
  * @retval None
  */
void DAC_Clock_EN(DAC_TypeDef *dac)
{
    /* DAC Periph clock enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
    /* Configure DAC GPIO pins */
    pinmap_pinout(g_current_pin, PinMap_DAC);
}


/**
  * @brief  This function will set the DAC to the required value
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @param  value : the value to push on the adc output
  * @param  do_init : if set to 1 the initialization of the adc is done
  * @retval None
  */
void dac_write_value(PinName pin, uint32_t value, uint8_t do_init)
{
  DAC_TypeDef *pdac=NULL;
  DAC_InitTypeDef  DAC_InitType = {0};

  uint32_t dacChannel;

  pdac = (DAC_TypeDef *)pinmap_peripheral(pin, PinMap_DAC);
  if (pdac == NP) {
    return;
  }
  dacChannel = get_dac_channel(pin);

  if (do_init == 1) 
  {
   #if defined(CH32L10x)
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOA, ENABLE );
	  RCC_PB1PeriphClockCmd(RCC_PB1Periph_DAC, ENABLE );   
   #else
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE );
	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE );
   #endif
    /*##-1- Configure the DAC peripheral */
    g_current_pin = pin;

    DAC_InitType.DAC_Trigger = DAC_Trigger_None;
    DAC_InitType.DAC_WaveGeneration = DAC_WaveGeneration_None;
    DAC_InitType.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bit0;
    DAC_InitType.DAC_OutputBuffer = DAC_OutputBuffer_Enable;

    /*##-2- Configure DAC channelx */
    DAC_Init(dacChannel, &DAC_InitType);
    
  }
  /*##-3- Set DAC Channelx DHR register */
    switch (dacChannel)
    {
      case DAC_Channel_1:
        DAC_SetChannel1Data(DAC_Align_12b_R, value);
        break;
     case DAC_Channel_2:
        DAC_SetChannel2Data(DAC_Align_12b_R, value);
        break;
     default:
        DAC_SetChannel1Data(DAC_Align_12b_R, 0);
        DAC_SetChannel2Data(DAC_Align_12b_R, 0);
        break;
    }

  /*##-4- Enable DAC Channelx*/
  DAC_Cmd(dacChannel, ENABLE);
}


/**
  * @brief  This function will stop the DAC
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @retval None
  */
void dac_stop(PinName pin)
{
  DAC_TypeDef *pdac=NULL;
  uint32_t dacChannel;

  pdac = (DAC_TypeDef *)pinmap_peripheral(pin, PinMap_DAC);
  if (pdac == NP) {
    return;
  }
  dacChannel = get_dac_channel(pin);
  //disable channel
  DAC_Cmd(dacChannel, DISABLE);

  DAC_DeInit( );
}
#endif //DAC_MODULE_ENABLED && !DAC_MODULE_ONLY




#if defined(ADC_MODULE_ENABLED) && !defined(ADC_MODULE_ONLY)
////////////////////////// ADC INTERFACE FUNCTIONS /////////////////////////////

/**
  * @brief ADC Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param padc: ADC handle pointer
  * @retval None
  */
void ADC_Clock_EN(ADC_TypeDef *padc)
{
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* ADC Periph clock enable */
  if (padc == ADC1) 
  {
     #ifdef RCC_APB2Periph_ADC1
      	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1	, ENABLE );	  //ENABLE ADC1 Clock
     #endif 

     #ifdef RCC_PB2Periph_ADC1
     RCC_PB2PeriphClockCmd(RCC_PB2Periph_ADC1	, ENABLE );	  //ENABLE ADC1 Clock for CH32L10x
     #endif
  }
#ifdef ADC2
  else if(padc == ADC2) 
  {
      #ifdef RCC_APB2Periph_ADC2
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2  , ENABLE );   //ENABLE ADC2 Clock 
      #endif 

      #ifdef RCC_PB2Periph_ADC2
      RCC_PB2PeriphClockCmd(RCC_PB2Periph_ADC2  , ENABLE );   //ENABLE ADC2 Clock for CH32L10x      
      #endif
  }
#endif
  /* Configure ADC GPIO pin */
  if (!(g_current_pin & PADC_BASE)) 
  {
      pinmap_pinout(g_current_pin, PinMap_ADC);
  }

  NVIC_EnableIRQ(ADC_IRQn);
}


/**
  * @brief  DeInitializes the ADC Moudle.
  * @param  padc: ADC handle
  * @retval None
  */
void ADC_Stop(ADC_TypeDef *padc)
{
    ADC_Cmd(padc,DISABLE); 
    #ifdef ADC_MODULE_OPTIONAL
    ISR_Set_ADC1_2_IRQHandler(NULL);
    #endif
}

/**
  * @brief  This function will set the ADC to the required value
  * @param  pin : the pin to use
  * @param  resolution : resolution for converted data: 8/10/12
  * @retval the value of the adc
  */
uint16_t adc_read_value(PinName pin, uint32_t resolution, uint8_t gain)
{

  ADC_TypeDef *padc ;
  ADC_InitTypeDef ADC_InitStructure={0};

  uint16_t uhADCxConvertedValue = 0;
  uint32_t samplingTime = ADC_SAMPLINGTIME;
  uint32_t channel = 0;

  if ((pin & PADC_BASE) && (pin < ANA_START))  //internal channle 
  {
    channel = get_adc_internal_channel(pin);
    samplingTime = ADC_SAMPLINGTIME_INTERNAL;
    padc = ADC1;
  } 
  else 
  {
    padc = (ADC_TypeDef *)pinmap_peripheral(pin, PinMap_ADC);
    channel = get_adc_channel(pin);
  }
  
  g_current_pin = pin;    
  ADC_Clock_EN(padc);  

#ifdef ADC_CLOCK_DIV
 #if !defined(CH32X035) 
  RCC_ADCCLKConfig(ADC_CLOCK_DIV);            /* (A)synchronous clock mode, input ADC clock divided */
 #else
  ADC_CLKConfig(padc, ADC_CLOCK_DIV);
 #endif 
#endif
#ifdef ADC_RESOLUTION_12B
#else
  (void) resolution;
#endif
#ifdef ADC_DataAlign_Right
  ADC_InitStructure.ADC_DataAlign            = ADC_DataAlign_Right;           /* Right-alignment for converted data */
#endif
  ADC_InitStructure.ADC_ScanConvMode         = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
 
  ADC_InitStructure.ADC_Mode                 = ADC_Mode_Independent;          /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  ADC_InitStructure.ADC_ContinuousConvMode   = DISABLE;
  ADC_InitStructure.ADC_NbrOfChannel         = 1; 
  ADC_InitStructure.ADC_ExternalTrigConv     = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_Pga                  = gain == 64 ? ADC_Pga_64 : gain == 16 ? ADC_Pga_16 : gain == 4 ? ADC_Pga_4 : ADC_Pga_1;
 #if !defined(CH32V00x) && !defined(CH32V10x)  && !defined(CH32VM00X)
  ADC_InitStructure.ADC_OutputBuffer         = ADC_OutputBuffer_Enable;
#endif
  ADC_Init(padc, &ADC_InitStructure);
  ADC_TempSensorVrefintCmd((pin & PADC_BASE) && (pin < ANA_START) ? ENABLE : DISABLE);
  padc->STATR = 0;
  
#ifdef ADC_MODULE_OPTIONAL
  ISR_Set_ADC1_2_IRQHandler(_REMAP_ISR_NAME(ADC1_2_IRQHandler, ArduinoADC_ISR));
#endif

#if USE_FREERTOS
  ADC_ITConfig(padc, ADC_IT_EOC, ENABLE);
#endif

  ADC_Cmd(padc,ENABLE); 

  /*##-2- Configure ADC regular channel ######################################*/  
  ADC_RegularChannelConfig(padc, channel, ADC_REGULAR_RANK_1, samplingTime );

#if USE_FREERTOS
  conversionDone = false;
  adcWaitingTaskHandle = xTaskGetCurrentTaskHandle();
#endif
  /*##-3- Start the conversion process ####################*/
  ADC_SoftwareStartConvCmd(padc, ENABLE);
  /*##-4- Wait for the end of conversion #####################################*/
#if USE_FREERTOS
  while (!conversionDone) {
    ulTaskNotifyTake(1, pdMS_TO_TICKS(10));
  }
#else
  while(!ADC_GetFlagStatus(padc, ADC_FLAG_EOC));
#endif
  conversionDone = false;
  
  uhADCxConvertedValue = ADC_GetConversionValue(padc);
  ADC_ClearFlag(padc, ADC_FLAG_EOC | ADC_FLAG_STRT | ADC_FLAG_AWD);

