morpheby/arduino_core_ch32/cores/arduino/ch32/analog.cpp
  ADC_TempSensorVrefintCmd(DISABLE);
  
#if USE_FREERTOS
  ADC_ITConfig(padc, ADC_IT_EOC, DISABLE);
  adcWaitingTaskHandle = nullptr;
#endif

  ADC_Stop(padc);
  ADC_DeInit(padc);

#if defined(ADC_CTLR_ADCAL)
  uint16_t calibration_value = 0;
  if (padc == ADC1)
    calibration_value = calibration_value_adc1;
  else if (padc == ADC2)
    calibration_value = calibration_value_adc2;

  // Calibration code is modulo-65536. For this reason, no additional checks needed,
  // just add the value.
  return uhADCxConvertedValue + calibration_value;
#else
  return uhADCxConvertedValue;
#endif
}

#if defined(ADC_CTLR_ADCAL)
void perform_adc_calibration(ADC_TypeDef *padc) {
  // Original code was something complicated and unstable. Instead we do it in a simpler way
  // here:
  // Calibration Code is technically just an offset value of (2^(res-1) + offset).
  // We take multiple measurements, sort, drop first 2 and last 2, and average 6 in the middle.
  // After that we calculate a 16-bit offset value that we will add to ADC measurements.

  ADC_Clock_EN(padc);  
  ADC_Cmd(padc,ENABLE);
  
#ifdef ADC_MODULE_OPTIONAL
  ISR_Set_ADC1_2_IRQHandler(_REMAP_ISR_NAME(ADC1_2_IRQHandler, ArduinoADC_ISR));
#endif

#if USE_FREERTOS
  ADC_ITConfig(padc, ADC_IT_EOC, ENABLE);
#endif

#if !defined(CH32V00x)
  ADC_BufferCmd(padc, DISABLE);   //disable buffer
#endif

#if USE_FREERTOS
  adcWaitingTaskHandle = xTaskGetCurrentTaskHandle();
#endif

  std::array<uint16_t, 10> buf;

  for (auto &c : buf) {
    ADC_ResetCalibration(padc);
    while(ADC_GetResetCalibrationStatus(padc));
    ADC_StartCalibration(padc);
    while(ADC_GetCalibrationStatus(padc)) {
#if USE_FREERTOS
      ulTaskNotifyTake(1, pdMS_TO_TICKS(10));
#endif
    }
    c = padc->RDATAR;
  }
	ADC_BufferCmd(padc, ENABLE);   //enable buffer

#if USE_FREERTOS
  ADC_ITConfig(padc, ADC_IT_EOC, DISABLE);
  adcWaitingTaskHandle = nullptr;
#endif

  ADC_Stop(padc);
  ADC_DeInit(padc);

  for (auto it1 = buf.begin(); it1 != buf.end(); ++it1) {
    for (auto it2 = it1 + 1; it2 != buf.end(); ++it2) {
      if (*it2 < *it1) {
        std::swap(*it1, *it2);
      }
    }
  }
  
  uint32_t sum = std::accumulate(buf.begin() + 2, buf.end() - 2, 0ull);

  // Check ADC calibration value is in the of expected range
  assert(sum > 1536 * 6 && sum < 2560 * 6);

  uint16_t calibration_value = (uint16_t) ( (1 << (ADC_RESOLUTION - 1)) - (sum / 6) );

    if (padc == ADC1) {
      calibration_value_adc1 = calibration_value;
    } else if (padc == ADC2) {
      calibration_value_adc2 = calibration_value;
    }
}
#endif

#endif /* ADC_MODULE_ENABLED && !ADC_MODULE_ONLY*/



#if defined(TIM_MODULE_ENABLED) && !defined(TIM_MODULE_ONLY)
////////////////////////// PWM INTERFACE FUNCTIONS /////////////////////////////

/**
  * @brief  This function will set the PWM to the required value
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @param  clock_freq : frequency of the tim clock
  * @param  value : the value to push on the PWM output
  * @retval None
  */
void pwm_start(PinName pin, uint32_t PWM_freq, uint32_t value, TimerCompareFormat_t resolution)
{
  TIM_TypeDef *Instance = (TIM_TypeDef *)pinmap_peripheral(pin, PinMap_TIM);
  HardwareTimer *HT;
  TimerModes_t previousMode;
  uint32_t index = get_timer_index(Instance);
  if (HardwareTimer_Handle[index] == NULL) {
    HardwareTimer_Handle[index]->__this = new HardwareTimer((TIM_TypeDef *)pinmap_peripheral(pin, PinMap_TIM));
  }

  HT = (HardwareTimer *)(HardwareTimer_Handle[index]->__this);

  uint32_t pinFunction = pinmap_function(pin, PinMap_TIM);
  pin_function(pin, pinFunction);
  uint32_t channel = CH_PIN_CHANNEL(pinFunction);

  previousMode = HT->getMode(channel);
  if (previousMode != TIMER_OUTPUT_COMPARE_PWM1) {
    HT->setMode(channel, TIMER_OUTPUT_COMPARE_PWM1, pin);
  }
  HT->setOverflow(PWM_freq, HERTZ_FORMAT);
  HT->setCaptureCompare(channel, value, resolution);
  if (previousMode != TIMER_OUTPUT_COMPARE_PWM1) {
    HT->resume();
  }
}
/**
  * @brief  This function will disable the PWM
  * @param  port : the gpio port to use
  * @param  pin : the gpio pin to use
  * @retval None
  */
void pwm_stop(PinName pin)
{
  TIM_TypeDef *Instance = (TIM_TypeDef *)pinmap_peripheral(pin, PinMap_TIM);
  HardwareTimer *HT;
  uint32_t index = get_timer_index(Instance);
  if (HardwareTimer_Handle[index] == NULL) {
    HardwareTimer_Handle[index]->__this = new HardwareTimer((TIM_TypeDef *)pinmap_peripheral(pin, PinMap_TIM));
  }

  HT = (HardwareTimer *)(HardwareTimer_Handle[index]->__this);
  if (HT != NULL) {
    delete (HT);
    HT = NULL;
  }
}
#endif /* TIM_MODULE_ENABLED && !TIM_MODULE_ONLY */

#ifdef __cplusplus
}
#endif

